import random

answers = [
    "Бесспорно",
    "Предрешено",
    "Никаких сомнений",
    "Определённо да",
    "Можешь быть уверен в этом",
    "Мне кажется - да",
    "Вероятнее всего",
    "Хорошие перспективы",
    "Знаки говорят - да",
    "Да",
    "Пока не ясно, попробуй снова",
    "Спроси позже",
    "Лучше не рассказывать",
    "Сейчас нельзя предсказать",
    "Сконцентрируйся и спроси опять",
    "Даже не думай",
    "Мой ответ - нет",
    "По моим данным - нет",
    "Перспективы не очень хорошие",
    "Весьма сомнительно"
]

print ("Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.")

name = input ("Как тебя зовут?")

print (f"Привет, {name}.")

while True:
    while True:
        question = input("Задай свой вопрос: ")
        if question != "":
            break
        print("Вопрос не может быть пустым! Попробуй еще раз.")

    answer = random.choice(answers)
    print(f"Шар отвечает: {answer}")

    repeat = input ("Хочешь задать еще один вопрос? (да / нет): ")
    if repeat == "нет":
        print(f"Возвращайся, если возникнут вопросы, {name}!")
        break
