print ("=== Система рейтинга продуктов ===")

grade = int(input ("Введите рейтинг продукта (1-10): "))

match grade:
    case 1 | 2 | 3:
        print ("Плохой продукт ❌ Не рекомендую")
    case 4 | 5 | 6:
        print ("Средний продукт 😐 Можно попробовать")
    case 7 | 8:
        print ("Хороший продукт 👍 Рекомендую к покупке")
    case 9 | 10:
        print ("Отличный продукт 🌟 Настоятельно рекомендую!")
    case _:
        print ("Вы ввели некорректный рейтинг. Пожалуйста, введите число от 1 до 10.")