import random

print ("=== Доступные статусы: ===")
print ()
print ("pending (в ожидании)")
print ("processing (в обработке)")
print ("shipped (отправлено)")
print ("delivered (доставлено)")
print ("cancelled (отменено)")
print ()
status = input ("Введите один из статусов выше (на латинице): ")

print ("=================================")
print ("|| 📦 СТАТУС ВАШЕГО ЗАКАЗА 📦 ||")
print ("=================================")
print ()

match status:
    case "shipped":
        print ("Статус: Отправлено ✈️")
        print ("Описание: Ваши заказ находится в пути к вам")
        print (f"Примерное время: {random.randint (2,5)} дней" )
        print ("Рекомендация: Следите за уведомлениями о доставке")

    case "processing":
        print ("Статус: В обработке 📦")
        print ("Описание: Заказ собирается")
        print (f"Примерное время: {random.randint (1,3)} часов" )
        print ("Рекомендация: Товары готовятся к отправке")

    case "pending":
        print ("Статус: В ожидании ⏳")
        print ("Описание: Заказ ожидает подтверждения и оплаты")
        print (f"Примерное время: {random.randint(10, 30)} минут")
        print ("Рекомендация: Пожалуйста, подождите подтверждения оплаты")

    case "delivered":
        print ("Статус: доставлено ✅")
        print ("Описание: Заказ успешно доставлен")
        print ("Рекомендация: Пожалуйста оцените нашу работу и оставьте комментарий!")

    case "cancelled":
        print ("Статус: отменено ❌")
        print ("Описание: Вы отменили заказ")
        print ("Рекомендация: Повторите заказ или напишите в техническую поддержку.")

    case _:
        print ("Ошибка: Неизвестный статус 'invalid_status'")




