# 1. int - Хранение текущего количества студентов в группе. Это целое число, в данном случае неотрицательное (напр. 12)
# 2. float - Хранение температуры в градусах Цельсия (например, 23.5). Это дробное число, требующее более точных значений.
# 3. str - Хранение логина пользователя (например, "ivanov_ivan"). Это текст, который позволяет ввести любую текстовую информацию.
# 4. bool - Хранение информации о том, включено ли уведомление (да/нет). Это выбор между разным состоянием (истина/ложь)
# 5. list - Хранение списка любимых фильмов. Это изменяемая коллекция (новые фильмы можно добавлять, удалять или менять местами) (Побег из Шоушенка, Зеленая миля, Бойцовский клуб)
# 6. tuple - Хранение координат точки в 2D пространстве (x, y), которые не должны изменяться после задания. Это фиксируемый, неизменяемый список.
# 7. set - Хранение уникальных ID товаров в корзине покупок. Это коллекция неповторяющихся элементов. (напр. {101, 102, 105})
# 8. dict - Хранение соответствия между названием страны и её столицей. Это пара "Ключ - значение". (Напр. {"Франция": "Париж"})
